#include "header.h"

void main()
{
	/*
	printf("예제 4-6 \n");
	example4_6();

	printf("\n\n예제 4-7 \n");
	example4_7();
	
	printf("\n\n예제 4-10 \n");
	example4_10();
	
	printf("\n\n예제 4-11 \n");
	example4_11();
	
	printf("\n\n예제 4-12 \n");
	example4_12()
	
	printf("\n\n예제 4-13 \n");
	example4_13();
	*/
	printf("\n\n예제 4-14 \n");
	example4_14();
}

/*
[출력]
예제 4-6 1
말일 검색하고 싶은 연도와 월을 입력 : 2020 2
2020년 2월은 29일까지이고 윤년입니다.

예제 4-6 2
말일 검색하고 싶은 연도와 월을 입력 : 2021 2
2021년 2월은 28일까지입니다.

예제 4-6 3
말일 검색하고 싶은 연도와 월을 입력 : 2022 4
2022년 4월은 30일까지입니다.

예제 4-7
성적 입력 : 80
학점은 B

예제 4-10
도는 하얀 도라지
레는 둥근 레코드
미는 파란 미나리
파는 예쁜 파랑새

예제 4-11
정수 입력(1~10) : 2
입력한 숫자는 2입니다.
프로그램을 종료합니다.

예제 4-12
횟수는 ? 6
ABCDEF

횟수는 ? 7
GHIJKLM

횟수는 ? 8
NOPQ

끝

예제 4-13
1 번째 실행 : sum = 1
2 번째 실행 : sum = 3
3 번째 실행 : sum = 6
4 번째 실행 : sum = 10
5 번째 실행 : sum = 15
6 번째 실행 : sum = 21
7 번째 실행 : sum = 28
8 번째 실행 : sum = 36
9 번째 실행 : sum = 45
10 번째 실행 : sum = 55
1부터 10까지의 합 = 55

예제 4-14

  -2단-   -3단-   -4단-   -5단-   -6단-   -7단-   -8단-   -9단-
 2x1= 2  3x1= 3  4x1= 4  5x1= 5  6x1= 6  7x1= 7  8x1= 8  9x1= 9
 2x2= 4  3x2= 6  4x2= 8  5x2=10  6x2=12  7x2=14  8x2=16  9x2=18
 2x3= 6  3x3= 9  4x3=12  5x3=15  6x3=18  7x3=21  8x3=24  9x3=27
 2x4= 8  3x4=12  4x4=16  5x4=20  6x4=24  7x4=28  8x4=32  9x4=36
 2x5=10  3x5=15  4x5=20  5x5=25  6x5=30  7x5=35  8x5=40  9x5=45
 2x6=12  3x6=18  4x6=24  5x6=30  6x6=36  7x6=42  8x6=48  9x6=54
 2x7=14  3x7=21  4x7=28  5x7=35  6x7=42  7x7=49  8x7=56  9x7=63
 2x8=16  3x8=24  4x8=32  5x8=40  6x8=48  7x8=56  8x8=64  9x8=72
 2x9=18  3x9=27  4x9=36  5x9=45  6x9=54  7x9=63  8x9=72  9x9=81
*/